OpenFOAM10/TripleFlame/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16384
(
(7.8125e-05 -0.00992187 0)
(0.000234375 -0.00992188 5.635e-19)
(0.000390625 -0.00992188 0)
(0.000546875 -0.00992188 2.87774e-19)
(0.000703125 -0.00992188 2.87774e-19)
(0.000859375 -0.00992188 2.87774e-19)
(0.00101562 -0.00992188 0)
(0.00117187 -0.00992187 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 -0.00992187 0)
(0 -0.00976562 0)
(0 -0.00960937 0)
(0 -0.00945312 0)
(0 -0.00929687 0)
(0 -0.00914062 0)
(0 -0.00898437 0)
(0 -0.00882813 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
384
(
(7.8125e-05 -0.01 0)
(0.000234375 -0.01 0)
(0.000390625 -0.01 0)
(0.000546875 -0.01 0)
(0.000703125 -0.01 0)
(0.000859375 -0.01 0)
(0.00101563 -0.01 0)
(0.00117188 -0.01 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
