OpenFOAM10/TripleFlame/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
7.8125e-05
0.000234375
0.000390625
0.000546875
0.000703125
0.000859375
0.00101562
0.00117187
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
384
(
7.8125e-05
0.000234375
0.000390625
0.000546875
0.000703125
0.000859375
0.00101563
0.00117188
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
