OpenFOAM10/TripleFlame/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
-0.00992187
-0.00992188
-0.00992188
-0.00992188
-0.00992188
-0.00992188
-0.00992188
-0.00992187
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.00992187
-0.00976562
-0.00960937
-0.00945312
-0.00929687
-0.00914062
-0.00898437
-0.00882813
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
384
(
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
