OpenFOAM10/TripleFlame/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
128
(
0.727469255166338504
0.727458891174049947
0.727445809895556080
0.727429358427778929
0.727408743199720502
0.727383003801736942
0.727350982932003826
0.727311294925081756
...
        );
    }
    /*    air
    {
        type            fixedValue;
        value           uniform 0.77;
    }*/
    outlet
    {
            type zeroGradient;

	    //        type            inletOutlet;
	    //inletValue      uniform 1;
	    //value           uniform 1;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
