OpenFOAM10/TripleFlame/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
128
(
0.217296024269808801
0.217292928531667467
0.217289021136559156
0.217284107061474896
0.217277949265712809
0.217270260873647846
0.217260696197701401
0.217248841337782425
...
);
    }
    /*    air
    {
        type            fixedValue;
        value           uniform 0.23;
	}*/
    outlet
    {
      type zeroGradient;

      //  type            inletOutlet;
      // inletValue      uniform 0;
      //  value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
